/****************************************************************************************************
*文件名称:    dht11.c
*文件描述:	  dht11操作函数集
*编写人:	  杨鹏飞
*编写时间:	  2016-9-2
*****************************************************************************************************/

#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <unistd.h>
#include <stdio.h>
#include <stdlib.h>

#include "dht11.h"


/****************************************************************************************************
*函数名称:    dht11_init
*函数参数:    无
*函数返回值:  成功返回fd,	失败返回FALSE
*函数描述:    dht11初始化函数
*****************************************************************************************************/
int dht11_init()
{
	int ret = 0;
	int fd = 0;
	
	fd = dht11_open(DHT11_DEV);
	if (fd < 0){
		printf("dht11_open error!\r\n");
		return FALSE;
	}

	return fd;

err:
	ret = dht11_close(fd);
	if (ret < 0)
		printf("dth11_close error!\r\n");
	return FALSE;
}

/****************************************************************************************************
*函数名称:    dht11_open
*函数参数:    dev_name:	设备名称
*函数返回值:  成功返回fd,	失败返回FALSE
*函数描述:    dht11打开函数
*****************************************************************************************************/
int dht11_open(char *dev_name)
{
	int fd = 0;
	fd = open(dev_name, O_RDWR);	/* 以可读可写的方式打开dht11设备 */
	if (fd <= 0){
		return FALSE;
	}

	return fd;
}

/****************************************************************************************************
*函数名称:    dht11_read
*函数参数:    fd:	文件描述符
*			  dht11_data:	dht数据保存结构体
*函数返回值:  成功返回len,	失败返回FALSE
*函数描述:    dht11读取温度湿度
*****************************************************************************************************/
int dht11_read(int fd, struct DHT11_Data *dht11_data)
{
	int len;
	len = read( fd, (char *)dht11_data, sizeof(struct DHT11_Data) );
	if (len <= 0)
		return FALSE;
	return len;
}


/****************************************************************************************************
*函数名称:    dht11_close
*函数参数:    fd:	文件描述符
*函数返回值:  成功返回SUCCEE,	失败返回FALSE
*函数描述:    dht11关闭函数
*****************************************************************************************************/
int dht11_close(fd)
{
	int ret = 0;
	ret = close(fd);
	if (ret < 0)
		return FALSE;
	return SUCCEE;
}